coder137/ROS-Repo/esp8266/rosserial_pub_test/src/main.cpp
#include <Arduino.h>

#include <ESP8266WiFi.h>
#include <ros.h>
#include <std_msgs/String.h>

const char * ssid = "ssid";
const char * password = "password";

// Set the rosserial socket server IP address
IPAddress server(192,168,29,186);
// Set the rosserial socket server port
const uint16_t serverPort = 11411;

ros::NodeHandle nh;
// Make a chatter publisher
std_msgs::String str_msg;
ros::Publisher chatter("chatter", &str_msg);

// Be polite and say hello
char hello[13] = "hello world!";

void setup() 
{
  // put your setup code here, to run once:
  Serial.begin(9600);
  Serial.println();
  Serial.print("Connecting to ");
  Serial.println(ssid);

  // Connect the ESP8266 the the wifi AP
  WiFi.begin(ssid, password);
  while (WiFi.status() != WL_CONNECTED) {
  delay(500);
  Serial.print(".");
  }
  Serial.println("");
  Serial.println("WiFi connected");
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());

  // Set the connection to rosserial socket server
  Serial.printf("Connecting to ROS Server: %s\n", server.toString().c_str());
  nh.getHardware()->setConnection(server, serverPort);
  nh.initNode();

  // Another way to get IP
  Serial.print("IP = ");
  Serial.println(nh.getHardware()->getLocalIP());

  // Start to be polite
  nh.advertise(chatter);
}

void loop() 
{
  // put your main code here, to run repeatedly:
  if (nh.connected())
  {
    Serial.println("Connected");
    // Say hello
    str_msg.data = hello;
    chatter.publish(&str_msg);
  }
  else
  {
    Serial.println("Not Connected");
  }
  nh.spinOnce();
  // Loop exproximativly at 1Hz
  delay(1000);
}